БИТУправление_медицинским_центром_демо/src/Documents/КомплексныйРасчетКлиента/КомплексныйРасчетКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КомплексныйРасчетКлиента</name>
  <registerRecords>AccumulationRegister.НоменклатураКомплексныхРасчетовКлиентов</registerRecords>
  <registerRecords>AccumulationRegister.ВыработкаСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладах</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыКомплексныхРасчетовКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Прейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Остановлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимыйДолг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Прием</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентАванса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИгнорироватьДолг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСоСкидкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИгнорироватьДолг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сырье</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>CatalogRef.ПараметрыСпецификаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДобавленАвтоматически</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиСортировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыРабот</name>
    <attributes>
      <name>ИдентификаторЭтапа</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторСтрокой</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительПлан</name>
      <type>
        <types>DefinedType.ИсполнителиЭтаповКомплексногоРасчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/НоменклатураКомплексныхРасчетовКлиентов/НоменклатураКомплексныхРасчетовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НоменклатураКомплексныхРасчетовКлиентов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КомплексныйРасчет</name>
    <type>
      <types>DefinedType.КомплексныйРасчетКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСтроки</name>
    <type>
      <types>CatalogRef.КлючиСтрокКомплексныхРасчетов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/Documents/КомплексныйРасчетКлиента/Forms/ФормаПодбораПозицийПоДокументу/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КомплексныйРасчет = Параметры.КомплексныйРасчет;
	
	// Перенос позиций, которые уже есть в документе, из которого открывается подбор и свёртка.
	Для Каждого СтрокаПозицииПриемникаПараметр Из Параметры.ПозицииПриемника Цикл
		ЗаполнитьЗначенияСвойств(ПозицииПриемника.Добавить(), СтрокаПозицииПриемникаПараметр);
	КонецЦикла;
	
	ТаблицаПозицииПриемника = РеквизитФормыВЗначение("ПозицииПриемника");
	ТаблицаПозицииПриемника.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Цена", "Количество");

	ОбщегоНазначения.ЗаполнитьВидНоменклатурыВКоллекции(ТаблицаПозицииПриемника);
	
	ЗначениеВРеквизитФормы(ТаблицаПозицииПриемника, "ПозицииПриемника");
	
	ОбновитьПозицииСервер();
	
	ПоказыватьОбщееКоличество = РаботаСФормамиСервер.ПолучитьНастройкуФормы("ФормаПодборКомплекта", "ПоказыватьОбщееКоличество", Истина);
	
	Если Параметры.РежимВозврат = Истина Тогда
		Заголовок = Заголовок + НСтр("ru='Возврат'") + ":";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриИзмененииПоказыватьОбщееКоличество();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиФормы = Новый Структура;
	НастройкиФормы.Вставить("ПоказыватьОбщееКоличество", ПоказыватьОбщееКоличество);
	
	РаботаСФормамиСервер.СохранитьНастройкиФормы(НастройкиФормы, "ФормаПодборКомплекта");
	
КонецПроцедуры
													
&НаКлиенте
Процедура ПоказыватьОбщееКоличествоПриИзменении(Элемент)
	ПриИзмененииПоказыватьОбщееКоличество();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПоказыватьОбщееКоличество()
	
	Элементы.ПозицииКоличествоВРасчете.Видимость = ПоказыватьОбщееКоличество;
	Элементы.ПозицииКоличествоСписано.Видимость	= ПоказыватьОбщееКоличество;
	
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
		
	ПараметрыОповещения = Новый Структура("ВладелецФормы", ВладелецФормы);
	
	Если Подбор.Количество() <> 0 Тогда
	
		РезультатПодбора = Новый Массив;
		
		Для Каждого СтрокаПодбора Из Подбор Цикл
			
			СтрокаРезультата = Новый Структура("Номенклатура, ВидНоменклатуры, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Цена, Количество");
			ЗаполнитьЗначенияСвойств(СтрокаРезультата, СтрокаПодбора);
			СтрокаРезультата.Количество = СтрокаПодбора.КоличествоПеренести;
			
			РезультатПодбора.Добавить(СтрокаРезультата);
			
		КонецЦикла;
			
		ПараметрыОповещения.Вставить("РезультатПодбора", РезультатПодбора);
		Оповестить("ПодборИзКомплексногоРасчетаКлиента", ПараметрыОповещения);
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПозиции(Команда)
	ОбновитьПозицииСервер();
КонецПроцедуры
	
&НаСервере	
Процедура ОбновитьПозицииСервер()
	
	Позиции.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КомплексныйРасчет", КомплексныйРасчет);
	Запрос.УстановитьПараметр("ПриемникСсылка", Параметры.ПриемникСсылка);
	Запрос.УстановитьПараметр("КомплексныйРасчет", КомплексныйРасчет);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураКомплексныхРасчетовКлиентовОбороты.КлючСтроки,
	|	НоменклатураКомплексныхРасчетовКлиентовОбороты.КлючСтроки.Номенклатура КАК Номенклатура,
	|	НоменклатураКомплексныхРасчетовКлиентовОбороты.КлючСтроки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	НоменклатураКомплексныхРасчетовКлиентовОбороты.КлючСтроки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	НоменклатураКомплексныхРасчетовКлиентовОбороты.КлючСтроки.Цена КАК Цена,
	|	СУММА(НоменклатураКомплексныхРасчетовКлиентовОбороты.КоличествоПриход) КАК КоличествоПриход,
	|	СУММА(НоменклатураКомплексныхРасчетовКлиентовОбороты.КоличествоРасход) КАК КоличествоРасход
	|ПОМЕСТИТЬ ОборотыРегистраторов
	|ИЗ
	|	РегистрНакопления.НоменклатураКомплексныхРасчетовКлиентов.Обороты(, , Регистратор, КомплексныйРасчет = &КомплексныйРасчет) КАК НоменклатураКомплексныхРасчетовКлиентовОбороты
	|ГДЕ
	|	НоменклатураКомплексныхРасчетовКлиентовОбороты.Регистратор <> &ПриемникСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураКомплексныхРасчетовКлиентовОбороты.КлючСтроки,
	|	НоменклатураКомплексныхРасчетовКлиентовОбороты.КлючСтроки.Номенклатура,
	|	НоменклатураКомплексныхРасчетовКлиентовОбороты.КлючСтроки.ХарактеристикаНоменклатуры,
	|	НоменклатураКомплексныхРасчетовКлиентовОбороты.КлючСтроки.ЕдиницаИзмерения,
	|	НоменклатураКомплексныхРасчетовКлиентовОбороты.КлючСтроки.Цена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыРегистраторов.КлючСтроки,
	|	ОборотыРегистраторов.Номенклатура,
	|	ОборотыРегистраторов.ХарактеристикаНоменклатуры,
	|	ОборотыРегистраторов.ЕдиницаИзмерения,
	|	ОборотыРегистраторов.Цена,
	|	ОборотыРегистраторов.КоличествоПриход,
	|	ОборотыРегистраторов.КоличествоРасход,
	|	ОборотыРегистраторов.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
	|ИЗ
	|	ОборотыРегистраторов КАК ОборотыРегистраторов"
	;
	Выб = Запрос.Выполнить().Выбрать();
	
	// *** Цена и Единица измерения в документе могут быть другими.
	// *** Разделение материалов и товаров.
	Отбор = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Цена");
	Пока Выб.Следующий() Цикл
		
		Остаток = Выб.КоличествоПриход - Выб.КоличествоРасход;
		
		СтрокаПозиции = Позиции.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПозиции, Выб);
		
		СтрокаПозиции.КоличествоВРасчете	= Выб.КоличествоПриход;
		СтрокаПозиции.КоличествоСписано		= Выб.КоличествоРасход;
		СтрокаПозиции.КоличествоОстаток		= Выб.КоличествоПриход - Выб.КоличествоРасход;
		
		ЗаполнитьЗначенияСвойств(Отбор, Выб);
		мсСтрокиПриемника = ПозицииПриемника.НайтиСтроки(Отбор);
		
		// Заполнение колонки "уже в документе" в случае подбора в оказание услуг.
		Если ТипЗнч(Параметры.ПриемникСсылка) = Тип("ДокументСсылка.ОказаниеУслуг") Тогда
			Если мсСтрокиПриемника.Количество() <> 0 Тогда
				// *** одни ли строка обязательно в случаях вольных настроек?.
				СтрокаПозиции.КоличествоУжеВПриемнике = мсСтрокиПриемника[0].Количество;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	Если ТипЗнч(Параметры.ПриемникСсылка) = Тип("ДокументСсылка.Прием") Тогда
		Отбор = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры");
		Для Каждого СтрокаПозицииПриемника Из ПозицииПриемника Цикл 
			ЗаполнитьЗначенияСвойств(Отбор, СтрокаПозицииПриемника);
			мсСтрокиРасчета = Позиции.НайтиСтроки(Отбор);
			Если мсСтрокиРасчета.Количество() <> 0 Тогда
				КоличествоНужноПристроить = СтрокаПозицииПриемника.Количество;
				Для Каждого СтрокаРасчета Из мсСтрокиРасчета Цикл
					Если СтрокаРасчета.КоличествоОстаток <> 0 Тогда
						СтрокаРасчета.КоличествоУжеВПриемнике = Мин(СтрокаРасчета.КоличествоОстаток, КоличествоНужноПристроить);
						КоличествоНужноПристроить = КоличествоНужноПристроить - СтрокаРасчета.КоличествоУжеВПриемнике;
					КонецЕсли;
				КонецЦикла;
				Если КоличествоНужноПристроить > 0 Тогда
					СтрокаРасчета.КоличествоУжеВПриемнике = СтрокаРасчета.КоличествоУжеВПриемнике + КоличествоНужноПристроить;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииКоличествоПеренестиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Позиции.ТекущиеДанные;
	Остаток = ОстатокПоСтроке(ТекущиеДанные);
	
	Если (ТекущиеДанные.КоличествоПеренести + ТекущиеДанные.КоличествоУжеВПриемнике) > Остаток Тогда
		ТекущиеДанные.КоличествоПеренести = Остаток - ТекущиеДанные.КоличествоУжеВПриемнике;
	КонецЕсли;
	ТекущиеДанные.КоличествоПеренести = Макс(0, ТекущиеДанные.КоличествоПеренести);
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииПриИзменении(Элемент)
	ПерезаполнитьСводныйПодбор();
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьСводныйПодбор()
	
	Подбор.Очистить();
// *** можно по ключу строки искать, добавлять, удалять строчку подбора, а не перезаполнять всё.	
	Для Каждого СтрокаПозиции Из Позиции Цикл
		Если СтрокаПозиции.КоличествоПеренести > 0 Тогда 
			СтрокаПодбор = Подбор.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПодбор, СтрокаПозиции);
			СтрокаПодбор.Сумма = СтрокаПодбор.Цена * СтрокаПодбор.КоличествоПеренести;
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьНадписьИтогоПодбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьИтогоПодбор()
	
	ШаблонСтроки = "Всего %1 позиций на сумму %2 %3";
	ДекорацияИтогоПодбор = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, 
																					Подбор.Количество(), 
																					ОбщегоНазначенияКлиентСервер.ФорматСумм(Подбор.Итог("Сумма")),
																					глКраткоеНаименованиеОсновнойВалюты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Подбор.ТекущиеДанные;
	
	Если ТекущиеДанные.КоличествоПеренести <> 0 Тогда
		мсСтрокиПозиций = Позиции.НайтиСтроки(Новый Структура("КлючСтроки", ТекущиеДанные.КлючСтроки));
		Если мсСтрокиПозиций.Количество() <> 0 Тогда
			мсСтрокиПозиций[0].КоличествоПеренести = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборКоличествоПеренестиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Подбор.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.КоличествоПеренести * ТекущиеДанные.Цена;
	
	мсСтрокиПозиций = Позиции.НайтиСтроки(Новый Структура("КлючСтроки", ТекущиеДанные.КлючСтроки));
	Если мсСтрокиПозиций.Количество() <> 0 Тогда
		мсСтрокиПозиций[0].КоличествоПеренести = ТекущиеДанные.КоличествоПеренести;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Остаток = ОстатокПоСтроке(ТекущиеДанные);
	
	Если Остаток > (ТекущиеДанные.КоличествоПеренести + ТекущиеДанные.КоличествоУжеВПриемнике) Тогда
		ТекущиеДанные.КоличествоПеренести = Мин(ТекущиеДанные.КоличествоПеренести + 1, Остаток - ТекущиеДанные.КоличествоУжеВПриемнике);
		ПерезаполнитьСводныйПодбор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОстатокПоСтроке(СтрокаСостава)
	
	Если Параметры.РежимВозврат Тогда
		// Для возврата - по уже списанному
		Возврат СтрокаСостава.КоличествоСписано;
	Иначе
		// Для продажи - по текущему остатку
		Возврат СтрокаСостава.КоличествоОстаток;
	КонецЕсли;
	
КонецФункции
